cmsis-svd/cmsis-svd/data/Nuvoton/M031AE_v1.svd
       <register derivedFrom="PWM_PERIOD0">
          <name>PWM_PERIOD2</name>
          <displayName>PWM_PERIOD2</displayName>
          <description>PWM Period Register 2</description>
          <addressOffset>0x38</addressOffset>
       </register>
       <register derivedFrom="PWM_PERIOD0">
          <name>PWM_PERIOD4</name>
          <displayName>PWM_PERIOD4</displayName>
          <description>PWM Period Register 4</description>
          <addressOffset>0x40</addressOffset>
       </register>
       <register>
          <name>PWM_CMPDAT0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PWM_CMPDAT0</displayName>
          <description>PWM Comparator Register 0</description>
          <addressOffset>0x50</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMP</name>
              <description>PWM Comparator Register\nCMP is used to compare with CNTR to generate PWM waveform, interrupt and trigger ADC.\nIn independent mode, PWM_CMPDAT0~5 denote as 6 independent PWM_CH0~5 compared point.\nIn complementary mode, PWM_CMPDAT0, 2, 4 denote as first compared point, and PWM_CMPDAT1, 3, 5 denote as second compared point for the corresponding 3 complementary pairs PWM_CH0 and PWM_CH1, PWM_CH2 and PWM_CH3, PWM_CH4 and PWM_CH5.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="PWM_CMPDAT0">
          <name>PWM_CMPDAT1</name>
          <displayName>PWM_CMPDAT1</displayName>
          <description>PWM Comparator Register 1</description>
          <addressOffset>0x54</addressOffset>
       </register>
       <register derivedFrom="PWM_CMPDAT0">
          <name>PWM_CMPDAT2</name>
          <displayName>PWM_CMPDAT2</displayName>
          <description>PWM Comparator Register 2</description>
          <addressOffset>0x58</addressOffset>
       </register>
       <register derivedFrom="PWM_CMPDAT0">
          <name>PWM_CMPDAT3</name>
          <displayName>PWM_CMPDAT3</displayName>
          <description>PWM Comparator Register 3</description>
          <addressOffset>0x5C</addressOffset>
       </register>
       <register derivedFrom="PWM_CMPDAT0">
          <name>PWM_CMPDAT4</name>
          <displayName>PWM_CMPDAT4</displayName>
          <description>PWM Comparator Register 4</description>
          <addressOffset>0x60</addressOffset>
       </register>
       <register derivedFrom="PWM_CMPDAT0">
          <name>PWM_CMPDAT5</name>
          <displayName>PWM_CMPDAT5</displayName>
          <description>PWM Comparator Register 5</description>
          <addressOffset>0x64</addressOffset>
       </register>
       <register>
          <name>PWM_DTCTL0_1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PWM_DTCTL0_1</displayName>
          <description>PWM Dead-time Control Register 0/1</description>
          <addressOffset>0x70</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DTCNT</name>
              <description>Dead-time Counter (Write Protect)\nThe dead-time can be calculated from the following formula: \nNote: This bit is write protected. Refer to SYS_REGLCTL register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTEN</name>
              <description>Enable Dead-time Insertion for PWM Pair (PWM_CH0, PWM_CH1) (PWM_CH2, PWM_CH3) (PWM_CH4, PWM_CH5) (Write Protect)\nDead-time insertion is only active when this pair of complementary PWM is enabled. If dead- time insertion is inactive, the outputs of pin pair are complementary without any delay.\nNote: This bit is write protected. Refer to SYS_REGLCTL register.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Dead-time insertion Disabled on the pin pair</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Dead-time insertion Enabled on the pin pair</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DTCKSEL</name>
              <description>Dead-time Clock Select (Write Protect)\nNote: This bit is write protected. Refer to REGWRPROT register.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Dead-time clock source from PWM_CLK</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Dead-time clock source from prescaler output</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="PWM_DTCTL0_1">
          <name>PWM_DTCTL2_3</name>
          <displayName>PWM_DTCTL2_3</displayName>
          <description>PWM Dead-time Control Register 2/3</description>
          <addressOffset>0x74</addressOffset>
       </register>
       <register derivedFrom="PWM_DTCTL0_1">
          <name>PWM_DTCTL4_5</name>
          <displayName>PWM_DTCTL4_5</displayName>
          <description>PWM Dead-time Control Register 4/5</description>
          <addressOffset>0x78</addressOffset>
       </register>
       <register>
          <name>PWM_CNT0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PWM_CNT0</displayName>
          <description>PWM Counter Register 0</description>
          <addressOffset>0x90</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>PWM Data Register (Read Only)\nUser can monitor CNTR to know the current value in 16-bit period counter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIRF</name>
              <description>PWM Direction Indicator Flag (Read Only)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Counter is counting down</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Counter is counting up</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="PWM_CNT0">
          <name>PWM_CNT2</name>
          <displayName>PWM_CNT2</displayName>
          <description>PWM Counter Register 2</description>
          <addressOffset>0x98</addressOffset>
       </register>
       <register derivedFrom="PWM_CNT0">
          <name>PWM_CNT4</name>
          <displayName>PWM_CNT4</displayName>
          <description>PWM Counter Register 4</description>
          <addressOffset>0xA0</addressOffset>
       </register>
